{
    "Act1Scene7": [
      {
        "speaker": "Macbeth",
        "text": "If it were done when ’tis done, then ’twere well It were done quickly. If th’ assassination Could trammel up the consequence and catch With his surcease success, that but this blow Might be the be-all and the end-all here, He’s here in double trust: First, as I am his kinsman and his subject, Strong both against the deed; then, as his host, Who should against his murderer shut the door, Not bear the knife myself. Besides, this Duncan Hath borne his faculties so meek, hath been So clear in his great office, that his virtues Will plead like angels, trumpet-tongued, against The deep damnation of his taking-off; To prick the sides of my intent, but only Vaulting ambition, which o’erleaps itself And falls on th’ other— How now, what news?",
        "responses": [
          {
            "text": "...",
            "next": "Lady Macbeth"
          }
        ]
      },
      {
        "speaker": "Lady Macbeth",
        "text": "He has almost supped. Why have you left the chamber?",
        "responses": [
          {
            "text": "...",
            "next": "Macbeth"
          }
        ]
      },
      {
        "speaker": "Macbeth",
        "text": "Hath he asked for me?",
        "responses": [
          {
            "text": "...",
            "next": "Lady Macbeth"
          }
        ]
      },
      {
        "speaker": "Lady Macbeth",
        "text": "Know you not he has?",
        "responses": [
          {
            "text": "...",
            "next": "Macbeth"
          }
        ]
      },
      {
        "speaker": "Macbeth",
        "text": "We will proceed no further in this business. He hath honored me of late, and I have bought Golden opinions from all sorts of people, Which would be worn now in their newest gloss, Not cast aside so soon.",
        "translation": "He as honored me as of late and i have earned the good opinion of people, which shouldn't be cast aside so soon.",
        "responses": [
          {
            "text": "...",
            "next": "Lady Macbeth"
          }
        ]
      },
      {
        "speaker": "Lady Macbeth",
        "text": "Was the hope drunk Wherein you dressed yourself? Hath it slept since? And wakes it now, to look so green and pale At what it did so freely? Art thou afeard To be the same in thine own act and valor As thou art in desire? Wouldst thou live a coward in thine own esteem,Letting “I dare not” wait upon “I would,”?",
        "responses": [
          {
            "text": "...",
            "next": "Macbeth"
          }
        ]
      },
      {
        "speaker": "Macbeth",
        "text": "Prithee, peace. I dare do all that may become a man. Who dares do more is none.",
        "responses": [
          {
            "text": "...",
            "next": "Lady Macbeth"
          }
        ]
      },
      {
        "speaker": "Lady Macbeth",
        "text": "What beast was ’t, then, That made you break this enterprise to me? When you durst do it, then you were a man; I have given suck, and know How tender ’tis to love the babe that milks me. I would, while it was smiling in my face, Have plucked my nipple from his boneless gums And dashed the brains out, had I so sworn as you Have done to this.",
        "responses": [
          {
            "text": "...",
            "next": "Macbeth"
          }
        ]
      },
      {
        "speaker": "Macbeth",
        "text": "If we should fail—",
        "responses": [
          {
            "text": "...",
            "next": "Lady Macbeth"
          }
        ]
      },
      {
        "speaker": "Lady Macbeth",
        "text": "But screw your courage to the sticking place And we’ll not fail. When Duncan is asleep his two chamberlains Will I with wine and wassail so convince That memory, the warder of the brain, Shall be a fume,  What cannot you and I perform upon Th’ unguarded Duncan? What not put upon His spongy officers, who shall bear the guilt Of our great quell?",
        "responses": [
          {
            "text": "...",
            "next": "Macbeth"
          }
        ]
      },
      {
        "speaker": "Macbeth",
        "text": "Bring forth men-children only, For thy undaunted mettle should compose Nothing but males. Will it not be received, When we have marked with blood those sleepy two Of his own chamber and used their very daggers, That they have done ’t?",
        "responses": [
          {
            "text": "...",
            "next": "Lady Macbeth"
          }
        ]
      },
      {
        "speaker": "Lady Macbeth",
        "text": "Who dares receive it other, As we shall make our griefs and clamor roar Upon his death?",
        "responses": [
          {
            "text": "...",
            "next": "Macbeth"
          }
        ]
      },
      {
        "speaker": "Macbeth",
        "text": "I am settled and bend up Each corporal agent to this terrible feat. Away, and mock the time with fairest show. False face must hide what the false heart doth Know.",
        "endScene": true
      }
    ]
  }
  