{
    "Act5Scene8Part1": [
        { 
            "speaker": "Macbeth",
            "text": "Why should I play the Roman fool and die On mine own sword? Whiles I see lives, the gashes do better upon them.",
            "responses": [{ "text": "Turn, hellhound, turn!", "next": "Macduff" }]
        },
        {   
            "speaker": "Macduff", 
            "text": "Turn, hellhound, turn!",
            "responses": [{ "text": "...", "next": "Macbeth" }]
        },
        {
            "speaker": "Macbeth",
            "text": "Of all men else I have avoided thee. But get thee back. My soul is too much charged With blood of thine already.",
            "translation" : "Out of everyone, you are the one I have avoided. My soul is stained too much with the blood of your family already." ,
            "responses": [{ "text": "I have no words", "next": "Macduff" }]
        },
        {
            "speaker": "Macduff",
            "text": "I have no words; My voice is in my sword.",
            "responses": [{ "text": "...", "next": "Macbeth" }]
        },
        {
            "speaker": "Macbeth",
            "text": "Thou losest labor. I bear a charmèd life, which must not yield To one of woman born.",
            "translation" : "You are wasting your time. I lead a charmed life, and I can't be defeated by someone born from a woman." ,
            "responses": [{ "text": "Despair thy charm", "next": "Macduff" }]
        },
        {
            "speaker": "Macduff",
            "text": "Despair thy charm, and let the angel whom thou still hast served tell thee Macduff was from his mother’s womb untimely ripped.",
            "translation" : "Then you should despair. I was cut out from my mother's womb before I could be delivered naturally." ,
            "responses": [{ "text": "...", "next": "Macbeth" }]
        },
        {
            "speaker": "Macbeth",
            "text": "Accursèd be that tongue that tells me so, for it hath cowed my better part of man! And be these juggling fiends no more believed",
            "translation" : "Curse you for telling this, now my courage had left me. I no longer believe those tricky witches" ,
            "responses": [{ "text": "Then yield thee, coward", "next": "Macduff" }]
        },
        {
            "speaker": "Macduff",
            "text": "Then yield thee, coward, and live to be the show and gaze o’ th’ time.",
            "translation" : "Then surrender coward, and live on as an amusement we all point and laugh at." ,
            "responses": [{ "text": "...", "next": "Macbeth" }]
        },
        {
            "speaker": "Macbeth",
            "text": "I will not yield to kiss the ground before young Malcolm’s feet and to be baited with the rabble’s curse.",
            "translation" : "I will not surrender and kiss the ground before Malcolm's feet and to be mocked by commoners." ,
            "responses": [{ "text": "...", "next": "Macbeth" }]
        },
        {
            "speaker": "Macbeth",
            "text": "Lay on, Macduff, And damned be him that first cries “Hold! Enough!”",
            "endScene": true
        }
    ]
}